{"config": [{"config": {"input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3], "trainable": true, "name": "normalizeimage_1"}, "class_name": "NormalizeImage"}, {"config": {"nb_col": 5, "trainable": true, "W_constraint": null, "name": "convolution2d_1", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "nb_row": 5, "subsample": [2, 2], "W_regularizer": null, "border_mode": "valid", "nb_filter": 24, "activation": "elu", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"nb_col": 5, "trainable": true, "W_constraint": null, "name": "convolution2d_2", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "nb_row": 5, "subsample": [2, 2], "W_regularizer": null, "border_mode": "valid", "nb_filter": 36, "activation": "elu", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"nb_col": 5, "trainable": true, "W_constraint": null, "name": "convolution2d_3", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "nb_row": 5, "subsample": [2, 2], "W_regularizer": null, "border_mode": "valid", "nb_filter": 48, "activation": "elu", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"nb_col": 3, "trainable": true, "W_constraint": null, "name": "convolution2d_4", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "nb_row": 3, "subsample": [1, 1], "W_regularizer": null, "border_mode": "valid", "nb_filter": 64, "activation": "elu", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"nb_col": 3, "trainable": true, "W_constraint": null, "name": "convolution2d_5", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "nb_row": 3, "subsample": [1, 1], "W_regularizer": null, "border_mode": "valid", "nb_filter": 64, "activation": "elu", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.25}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "trainable": true, "W_constraint": null, "name": "dense_1", "output_dim": 100, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "input_dim": 1152, "bias": true, "activation": "elu"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.25}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "trainable": true, "W_constraint": null, "name": "dense_2", "output_dim": 50, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "input_dim": 100, "bias": true, "activation": "elu"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.25}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "trainable": true, "W_constraint": null, "name": "dense_3", "output_dim": 10, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "input_dim": 50, "bias": true, "activation": "elu"}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "trainable": true, "W_constraint": null, "name": "dense_4", "output_dim": 1, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "input_dim": 10, "bias": true, "activation": "linear"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}