{"config": [{"config": {"name": "normalizeimage_1", "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3]}, "class_name": "NormalizeImage"}, {"config": {"activity_regularizer": null, "dim_ordering": "tf", "activation": "relu", "trainable": true, "W_constraint": null, "nb_row": 5, "W_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "bias": true, "nb_filter": 24, "nb_col": 5, "name": "convolution2d_1", "b_constraint": null, "b_regularizer": null, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "dim_ordering": "tf", "activation": "relu", "trainable": true, "W_constraint": null, "nb_row": 5, "W_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "bias": true, "nb_filter": 36, "nb_col": 5, "name": "convolution2d_2", "b_constraint": null, "b_regularizer": null, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "dim_ordering": "tf", "activation": "relu", "trainable": true, "W_constraint": null, "nb_row": 5, "W_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "bias": true, "nb_filter": 48, "nb_col": 5, "name": "convolution2d_3", "b_constraint": null, "b_regularizer": null, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "dim_ordering": "tf", "activation": "relu", "trainable": true, "W_constraint": null, "nb_row": 3, "W_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "bias": true, "nb_filter": 64, "nb_col": 3, "name": "convolution2d_4", "b_constraint": null, "b_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "dim_ordering": "tf", "activation": "relu", "trainable": true, "W_constraint": null, "nb_row": 3, "W_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "bias": true, "nb_filter": 64, "nb_col": 3, "name": "convolution2d_5", "b_constraint": null, "b_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "activation": "relu", "trainable": true, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "input_dim": null, "name": "dense_1", "b_constraint": null, "b_regularizer": null, "output_dim": 100}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "activation": "relu", "trainable": true, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "input_dim": null, "name": "dense_2", "b_constraint": null, "b_regularizer": null, "output_dim": 50}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "activation": "relu", "trainable": true, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "input_dim": null, "name": "dense_3", "b_constraint": null, "b_regularizer": null, "output_dim": 10}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "activation": "linear", "trainable": true, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "input_dim": null, "name": "dense_4", "b_constraint": null, "b_regularizer": null, "output_dim": 1}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}