{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "NormalizeImage", "config": {"name": "normalizeimage_1", "batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "b_constraint": null, "trainable": true, "subsample": [2, 2], "b_regularizer": null, "nb_filter": 24, "W_regularizer": null, "bias": true, "nb_row": 5, "border_mode": "valid", "W_constraint": null, "activation": "elu", "dim_ordering": "tf", "init": "glorot_uniform", "nb_col": 5, "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "b_constraint": null, "trainable": true, "subsample": [2, 2], "b_regularizer": null, "nb_filter": 36, "W_regularizer": null, "bias": true, "nb_row": 5, "border_mode": "valid", "W_constraint": null, "activation": "elu", "dim_ordering": "tf", "init": "glorot_uniform", "nb_col": 5, "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "b_constraint": null, "trainable": true, "subsample": [2, 2], "b_regularizer": null, "nb_filter": 48, "W_regularizer": null, "bias": true, "nb_row": 5, "border_mode": "valid", "W_constraint": null, "activation": "elu", "dim_ordering": "tf", "init": "glorot_uniform", "nb_col": 5, "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "b_constraint": null, "trainable": true, "subsample": [1, 1], "b_regularizer": null, "nb_filter": 64, "W_regularizer": null, "bias": true, "nb_row": 3, "border_mode": "valid", "W_constraint": null, "activation": "elu", "dim_ordering": "tf", "init": "glorot_uniform", "nb_col": 3, "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "b_constraint": null, "trainable": true, "subsample": [1, 1], "b_regularizer": null, "nb_filter": 64, "W_regularizer": null, "bias": true, "nb_row": 3, "border_mode": "valid", "W_constraint": null, "activation": "elu", "dim_ordering": "tf", "init": "glorot_uniform", "nb_col": 3, "activity_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.25}}, {"class_name": "Dense", "config": {"name": "dense_1", "input_dim": 1152, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "activation": "elu", "trainable": true, "init": "glorot_uniform", "output_dim": 100}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.25}}, {"class_name": "Dense", "config": {"name": "dense_2", "input_dim": 100, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "activation": "elu", "trainable": true, "init": "glorot_uniform", "output_dim": 50}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.25}}, {"class_name": "Dense", "config": {"name": "dense_3", "input_dim": 50, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "activation": "elu", "trainable": true, "init": "glorot_uniform", "output_dim": 10}}, {"class_name": "Dense", "config": {"name": "dense_4", "input_dim": 10, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "trainable": true, "init": "glorot_uniform", "output_dim": 1}}]}