{"class_name": "Sequential", "config": [{"class_name": "NormalizeImage", "config": {"trainable": true, "name": "normalizeimage_1", "input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3]}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_regularizer": null, "subsample": [2, 2], "b_constraint": null, "bias": true, "name": "convolution2d_1", "nb_row": 5, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "relu", "activity_regularizer": null, "nb_col": 5, "nb_filter": 24}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_regularizer": null, "subsample": [2, 2], "b_constraint": null, "bias": true, "name": "convolution2d_2", "nb_row": 5, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "relu", "activity_regularizer": null, "nb_col": 5, "nb_filter": 36}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_regularizer": null, "subsample": [2, 2], "b_constraint": null, "bias": true, "name": "convolution2d_3", "nb_row": 5, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "relu", "activity_regularizer": null, "nb_col": 5, "nb_filter": 48}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_regularizer": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "name": "convolution2d_4", "nb_row": 3, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "relu", "activity_regularizer": null, "nb_col": 3, "nb_filter": 64}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "W_regularizer": null, "subsample": [1, 1], "b_constraint": null, "bias": true, "name": "convolution2d_5", "nb_row": 3, "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "relu", "activity_regularizer": null, "nb_col": 3, "nb_filter": 64}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.25, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_constraint": null, "bias": true, "name": "dense_1", "b_regularizer": null, "input_dim": 1152, "trainable": true, "output_dim": 100, "W_constraint": null, "activation": "relu", "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.25, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_constraint": null, "bias": true, "name": "dense_2", "b_regularizer": null, "input_dim": 100, "trainable": true, "output_dim": 50, "W_constraint": null, "activation": "relu", "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.25, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_constraint": null, "bias": true, "name": "dense_3", "b_regularizer": null, "input_dim": 50, "trainable": true, "output_dim": 10, "W_constraint": null, "activation": "relu", "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_constraint": null, "bias": true, "name": "dense_4", "b_regularizer": null, "input_dim": 10, "trainable": true, "output_dim": 1, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform"}}], "keras_version": "1.2.1"}